AVSystem/Anjay-freertos-client/Projects/STM32L496G-DISCO/2_Images_SBSFU/SBSFU/Target/sfu_low_level_security.c
    if (HAL_FLASHEx_OBProgram(psFlashOptionBytes) == HAL_OK)
    {
      *pbIsProtectionToBeApplied |= 1U;
      e_ret_status = SFU_SUCCESS;
      /* Execution stopped if flow control failed */
      FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_WRP, FLOW_CTRL_WRP);
    }
#else
    TRACE("\r\n= [SBOOT] System Security Configuration failed: WRP is incorrect. STOP!");
    /* Security issue : execution stopped ! */
    SFU_EXCPT_Security_Error();
#endif /* SECBOOT_OB_DEV_MODE */
  }

  return e_ret_status;
}
#endif /*SFU_WRP_PROTECT_ENABLE*/

#ifdef SFU_MPU_PROTECT_ENABLE
/**
  * @brief  Apply MPU protection before executing UserApp
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionMPU_UserApp(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
  MPU_InitStruct.Number               = MPU_REGION_NUMBER6;
  MPU_InitStruct.BaseAddress          = APP_PROTECT_MPU_AREA_ACTIVE_SLOT_START;
  MPU_InitStruct.Size                 = APP_PROTECT_MPU_AREA_ACTIVE_SLOT_SIZE;
  MPU_InitStruct.SubRegionDisable     = APP_PROTECT_MPU_AREA_ACTIVE_SLOT_SREG;
  MPU_InitStruct.AccessPermission     = APP_PROTECT_MPU_AREA_ACTIVE_SLOT_PERM;
  MPU_InitStruct.DisableExec          = APP_PROTECT_MPU_AREA_ACTIVE_SLOT_EXEC;
  MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsBufferable         = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable          = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.TypeExtField         = MPU_TEX_LEVEL0;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
  MPU_InitStruct.Number               = MPU_REGION_NUMBER7;
  MPU_InitStruct.BaseAddress          = APP_PROTECT_MPU_AREA_HIDE_START;
  MPU_InitStruct.Size                 = APP_PROTECT_MPU_AREA_HIDE_SIZE;
  MPU_InitStruct.SubRegionDisable     = APP_PROTECT_MPU_AREA_HIDE_SREG;
  MPU_InitStruct.AccessPermission     = APP_PROTECT_MPU_AREA_HIDE_PERM;
  MPU_InitStruct.DisableExec          = APP_PROTECT_MPU_AREA_HIDE_EXEC;
  MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsBufferable         = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable          = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.TypeExtField         = MPU_TEX_LEVEL0;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);


  return SFU_SUCCESS;
}
#endif /* SFU_MPU_PROTECT_ENABLE */

#if  (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
/**
  * @brief  Apply MPU protection before executing Standalone loader
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionMPU_StandaloneLoader(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
  MPU_InitStruct.Number               = MPU_REGION_NUMBER6;
  MPU_InitStruct.BaseAddress          = LOADER_PROTECT_MPU_AREA_START;
  MPU_InitStruct.Size                 = LOADER_PROTECT_MPU_AREA_SIZE;
  MPU_InitStruct.SubRegionDisable     = LOADER_PROTECT_MPU_AREA_SREG;
  MPU_InitStruct.AccessPermission     = LOADER_PROTECT_MPU_AREA_PERM;
  MPU_InitStruct.DisableExec          = LOADER_PROTECT_MPU_AREA_EXEC;
  MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsBufferable         = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable          = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.TypeExtField         = MPU_TEX_LEVEL0;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  return SFU_SUCCESS;
}
#endif /* (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */

#ifdef SFU_MPU_PROTECT_ENABLE

/**
  * @brief  Apply MPU protection
  * @param  uStep Configuration step : SFU_INITIAL_CONFIGURATION, SFU_SECOND_CONFIGURATION, SFU_THIRD_CONFIGURATION
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionMPU(uint8_t uStep)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  /**
    * ===== MPU regions =====
    * The executable code is made of: {SB_SFU vectors, SE_CoreBin, SB_SFU}
    * This executable code is mapped with 2 MPU regions:
    *   - Region 1: size up to 128kB with up to 8*16kB sub-regions
    *   - Region 2: size up to 16kB  with up to 8*2kB sub-regions
    * Region 2 is placed right after Region 1, even if Region 1 is smaller than 128kB.
    *
    *
    * IMPORTANT: the maximum executable size is NOT 128kB + 16kB.
    *            The algorithm accepts a size up to 128kB + 16kB - 1 byte.
    *
    * Examples:
    *
    * 1. Region 1 is 128kB long with Region 2 being 4kB long
    * <--------------128kB---------------><-------16kB--------->
    * [Reg.1.1][Reg.1.2].........[Reg.1.8][Reg.2.1][Reg.2.2].FF.   (.FF. means deactivated)
    *
    * 2. Region 1 is 64kB long with Region 2 being 6kB long
    * <---------------64kB---------------><------------16kB------------->
    * [Reg.1.1][Reg.1.2].........[Reg.1.4][Reg.2.1][Reg.2.2][Reg.2.3].FF.   (.FF. means deactivated)
    *
    * The size covered by region 1 corresponds to the quotient of the sbsfu code size divided by 16kB.
    * The size covered by region 2 corresponds to the remainder of the sbsfu code size divided by 16kB, rounded-up to
    * the next 2kB.
    */
  uint32_t region1_first_16kb_sub_region_disabled; /* index of the first sub-region to be disabled in region 1 */
  uint32_t region2_first_2kb_sub_region_disabled;  /* index of the first sub-region to be disabled in region 2 */
  /* The total size of the executable code is: SFU_ROM_ADDR_END - FLASH_BASE + 1 */
  uint32_t sbsfu_code_size = (SFU_ROM_ADDR_END - FLASH_BASE + 1U);  /* sbsfu, secure engine, callgate, se_interface,
                                                                      PCROPed keys... */
  uint8_t mpu_region_num; /* id of the MPU region being configured */

  /* Check/Apply MPU **********************************************************/
  MPU_Region_InitTypeDef MPU_InitStruct;

