AVSystem/Anjay-freertos-client/Projects/STM32L496G-DISCO/2_Images_SBSFU/SBSFU/Target/sfu_low_level_security.c
  /* Compute the number of 16Kbytes sub-regions required to cover the executable size in Region 1 (up to 8 maximum).
    * This number of sub-regions is the left-SHIFT value we apply to decide which regions are disabled.
    * The total size of the executable code is: SFU_ROM_ADDR_END - FLASH_BASE + 1 (sbsfu, secure engine, callgate,
    * se_interface, PCROPed keys...)
    *
    * WATCH OUT: This value cannot exceed SFU_PROTECT_MPU_MAX_NB_SUBREG (8 sub-regions).
    */
  region1_first_16kb_sub_region_disabled = sbsfu_code_size >> 14U ; /* shifting by 14 to divide by 16k */

  /* Compute the remainder of the code size divided by 16k */
  region2_first_2kb_sub_region_disabled = sbsfu_code_size & 16383U;

  /* Compute the number of 2Kbytes sub-regions required to cover the end of the executable in Region 2 (up to 8 maximum)
    * This number of sub-regions is the left-SHIFT value we apply to decide which regions are disabled.
    */
  if (region2_first_2kb_sub_region_disabled != 0U)
  {
    /*
      * The code size is not a multiple of 16k.
      * We compute the number of 2kB sub-regions needed in Region 2.
      *
      * +2047 to round-up to next 2k and shifting by 11 to divide by 2k
      */
    region2_first_2kb_sub_region_disabled = ((region2_first_2kb_sub_region_disabled + 2047U) >> 11U);
  }
  else
  {
    /*
      * No remainder: the code size is a multiple of 16k.
      * 2 possibilities but only 1 is supported:
      *  - All 2kB sub-regions are needed in Region 2 if the executable size is 128kB + 16kB.
      *    In this case, region1_first_16kb_sub_region_disabled reaches 9 so exceeds 8 and we return an error.
      *    NOT SUPPORTED
      *
      *  - Or no 2Kb sub-region is needed in Region 2 because the executable is contained fully in Region 1.
      *    SUPPORTED
      */
    region2_first_2kb_sub_region_disabled = 0; /* Will result in 0xFF << 0 : disable all sub-regions */
  }
  /*
    * If the executable size is more than 128kB + 16kB - 1 byte then we return an error,
    * because the algorithm would try configuring 9 sub-regions of 16kB.
    * Restriction: the current algorithm cannot compute that we need 8*16kB + 8*2kB.
    */
  if (region1_first_16kb_sub_region_disabled <= SFU_PROTECT_MPU_MAX_NB_SUBREG)
  {
    e_ret_status = SFU_SUCCESS;

#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n\t  [MPU] Region 1 with %d sub-region(s).", region1_first_16kb_sub_region_disabled);
    TRACE("\r\n\t  [MPU] Region 2 with %d sub-region(s).", region2_first_2kb_sub_region_disabled);
#endif /* SFU_VERBOSE_DEBUG_MODE */

    /* Sanity check: let's make sure the MPU settings cover the executable code */
    if (((region1_first_16kb_sub_region_disabled * 16384U) + (region2_first_2kb_sub_region_disabled * 2048U)) <
        sbsfu_code_size)
    {
      /* The MPU settings do not cover properly the executable code size */
      TRACE("\r\n [MPU] Executable code (%lu bytes) not fully covered !", sbsfu_code_size);
      return SFU_ERROR;
    }
    /* else the MPU settings cover at least the executable code size */

#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n= [SBOOT] MPU REGIONS CONFIGURATION");
#endif /* SFU_VERBOSE_DEBUG_MODE */
    /* The UserApp needs to know this configuration in case it wants to use the same WRP Areas */
    /* Initializes and configures the Region and the memory to be protected */
    for (mpu_region_num = 0U; mpu_region_num < (sizeof(MpuAreas) / sizeof(SFU_MPU_InitTypeDef)); mpu_region_num++)
    {
      MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
      MPU_InitStruct.Number               = MpuAreas[mpu_region_num].Number;
      MPU_InitStruct.BaseAddress          = MpuAreas[mpu_region_num].BaseAddress;
      MPU_InitStruct.Size                 = MpuAreas[mpu_region_num].Size;
      MPU_InitStruct.SubRegionDisable     = MpuAreas[mpu_region_num].SubRegionDisable;
      MPU_InitStruct.TypeExtField         = MPU_TEX_LEVEL0;
      MPU_InitStruct.AccessPermission     = MpuAreas[mpu_region_num].AccessPermission;
      MPU_InitStruct.DisableExec          = MpuAreas[mpu_region_num].DisableExec;
      MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
      MPU_InitStruct.IsCacheable          = MPU_ACCESS_CACHEABLE;
      MPU_InitStruct.IsBufferable         = MPU_ACCESS_NOT_BUFFERABLE;

#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n\t  Region %d", mpu_region_num);
#endif /* SFU_VERBOSE_DEBUG_MODE */

      if (mpu_region_num == 1U)
      {
        /* Region 1 (executable, up to 128kB with up to 8*16kB sub-regions) */
        MPU_InitStruct.SubRegionDisable = (uint8_t)(0xffU << region1_first_16kb_sub_region_disabled);
      }
      else if (mpu_region_num == 2U)
      {
        /* Region 2 (executable, up to 16kB with up to 8*2kB sub-regions) */
        MPU_InitStruct.SubRegionDisable = (uint8_t)(0xffU << region2_first_2kb_sub_region_disabled);
        /* The region start address is the 16k-aligned address before the end address of the executable area */
        MPU_InitStruct.BaseAddress = (SFU_ROM_ADDR_END  & ~16383U); /* 16k LSBs set to 0 */
      }
      else
      {
        /*  keep the settings from the constant */
      }

#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE(" @:%x size:%x sub:%x perm:%x exec:%x",
            MPU_InitStruct.BaseAddress, MPU_InitStruct.Size, MPU_InitStruct.SubRegionDisable,
            MPU_InitStruct.AccessPermission,  MPU_InitStruct.DisableExec);
#endif /* SFU_VERBOSE_DEBUG_MODE */

      if (uStep == SFU_INITIAL_CONFIGURATION)
      {
        HAL_MPU_ConfigRegion(&MPU_InitStruct);
      }
      else
      {
        if (MPU_CheckConfig(&MPU_InitStruct) == SFU_ERROR)
        {
          return SFU_ERROR;
        }
      }
    }

    if (uStep == SFU_INITIAL_CONFIGURATION)
    {
#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n");
#endif /* SFU_VERBOSE_DEBUG_MODE */
      /* Enables the MPU */
      HAL_MPU_Enable(MPU_HARDFAULT_NMI);

#if defined(SCB_SHCSR_MEMFAULTENA_Msk)
      /* Enables memory fault exception */
      SCB->SHCSR |= SCB_SHCSR_MEMFAULTENA_Msk;
#endif /* SCB_SHCSR_MEMFAULTENA_Msk */
    }
    else
    {
      if (MPU->CTRL != (MPU_HARDFAULT_NMI | MPU_CTRL_ENABLE_Msk))
      {
        return SFU_ERROR;
      }
#if defined(SCB_SHCSR_MEMFAULTENA_Msk)
      if ((SCB->SHCSR & SCB_SHCSR_MEMFAULTENA_Msk) != SCB_SHCSR_MEMFAULTENA_Msk)
      {
        return SFU_ERROR;
      }
#endif /* SCB_SHCSR_MEMFAULTENA_Msk */
    }

  } /* Else: too many sub-regions in Region 1, return SFU_ERROR */
#if defined(SFU_VERBOSE_DEBUG_MODE)
  else
  {
    TRACE("\r\n\t  [MPU] Too many MPU sub-regions in Region 1 : %d > %d", region1_first_16kb_sub_region_disabled,
          SFU_PROTECT_MPU_MAX_NB_SUBREG);
  }
#endif /* SFU_VERBOSE_DEBUG_MODE */

  if (e_ret_status == SFU_SUCCESS)
  {
    /* Execution stopped if flow control failed */
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_MPU, FLOW_CTRL_MPU);
  }
  return e_ret_status;
}
#endif /*SFU_MPU_PROTECT_ENABLE*/


