AVSystem/Anjay-freertos-client/Projects/STM32L496G-DISCO/2_Images_SBSFU/SBSFU/Target/sfu_low_level_security.c
#ifdef SFU_FWALL_PROTECT_ENABLE
/**
  * @brief  Check if FWALL protection is enabled.
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_CheckProtectionFWALL(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  if (__HAL_FIREWALL_IS_ENABLED() != RESET)
  {
    /* Firewall enabled: from this point, the Firewall is closed */
    e_ret_status = SFU_SUCCESS;
    /* Execution stopped if flow control failed */
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_FWALL, FLOW_CTRL_FWALL);
  }
  return e_ret_status;
}

/**
  * @brief  Apply FWALL protection: CODE, NVDATA and VDATA.
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionFWALL(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  FIREWALL_InitTypeDef FWALL_InitStruct;
  FIREWALL_InitTypeDef FWALL_VerifStruct;

  /* Protected code segment start address and length (it has to be multiple of 256 bytes). */
  FWALL_InitStruct.CodeSegmentStartAddress      = SFU_PROTECT_FWALL_CODE_ADDR_START;
  FWALL_InitStruct.CodeSegmentLength            = SFU_PROTECT_FWALL_CODE_SIZE;

  /* Protected Non volatile data segment (in Flash memory) start address and length */
  FWALL_InitStruct.NonVDataSegmentStartAddress    = SFU_PROTECT_FWALL_NVDATA_ADDR_START;
  FWALL_InitStruct.NonVDataSegmentLength          = SFU_PROTECT_FWALL_NVDATA_SIZE;

  /* Protected volatile data segment (in SRAM1 memory) start address and length */
  FWALL_InitStruct.VDataSegmentStartAddress    = SFU_PROTECT_FWALL_VDATA_ADDR_START;
  FWALL_InitStruct.VDataSegmentLength          = SFU_PROTECT_FWALL_VDATA_SIZE;

  /* The protected volatile data segment can't be executed */
  FWALL_InitStruct.VolatileDataExecution       = FIREWALL_VOLATILEDATA_NOT_EXECUTABLE;

  /* The protected volatile data segment is shared with non-protected
  application code */
  FWALL_InitStruct.VolatileDataShared          = FIREWALL_VOLATILEDATA_NOT_SHARED;

  /* Firewall configuration */
  if (HAL_FIREWALL_Config(&FWALL_InitStruct) == HAL_OK)
  {
    /* Verify firewall configuration */
    HAL_FIREWALL_GetConfig(&FWALL_VerifStruct);
    if ((FWALL_VerifStruct.CodeSegmentStartAddress == (SFU_PROTECT_FWALL_CODE_ADDR_START & FW_CSSA_ADD)) &&
        (FWALL_VerifStruct.CodeSegmentLength == (SFU_PROTECT_FWALL_CODE_SIZE & FW_CSL_LENG)) &&
        (FWALL_VerifStruct.NonVDataSegmentStartAddress == (SFU_PROTECT_FWALL_NVDATA_ADDR_START & FW_NVDSSA_ADD)) &&
        (FWALL_VerifStruct.NonVDataSegmentLength == (SFU_PROTECT_FWALL_NVDATA_SIZE & FW_NVDSL_LENG)) &&
        (FWALL_VerifStruct.VDataSegmentStartAddress == (SFU_PROTECT_FWALL_VDATA_ADDR_START & FW_VDSSA_ADD)) &&
        (FWALL_VerifStruct.VDataSegmentLength == (SFU_PROTECT_FWALL_VDATA_SIZE & FW_VDSL_LENG)) &&
        (FWALL_VerifStruct.VolatileDataExecution == (FIREWALL_VOLATILEDATA_NOT_EXECUTABLE & FW_CR_VDE)) &&
        (FWALL_VerifStruct.VolatileDataShared == (FIREWALL_VOLATILEDATA_NOT_SHARED & FW_CR_VDS)))
    {
      /* Enable Firewall */
      HAL_FIREWALL_EnableFirewall();
      /* Check the outcome of the enable procedure */
      if (__HAL_FIREWALL_IS_ENABLED() != RESET)
      {
        /* Firewall enabled: from this point, the Firewall is closed */
        e_ret_status = SFU_SUCCESS;
        /* Execution stopped if flow control failed */
        FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_FWALL, FLOW_CTRL_FWALL);
      }
    }
  }
  return e_ret_status;
}
#endif /* SFU_FWALL_PROTECT_ENABLE */

#ifdef SFU_DMA_PROTECT_ENABLE
/**
  * @brief  Apply DMA protection
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionDMA(void)
{
  /*
   * In this function we disable the DMA buses in order to avoid that while the SB/SFU is running
   * some DMA has been already enabled (e.g. through debugger in RDP-1 after reset) in order to access sensitive
   * information in SRAM, FLASH
   */
  /* Disable  DMA1, DMA2 */
  __HAL_RCC_DMA1_CLK_DISABLE();

  __HAL_RCC_DMA2_CLK_DISABLE();


  /*  Disable DMA2D */
  __HAL_RCC_DMA2D_CLK_DISABLE();



  /* Execution stopped if flow control failed */
  FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_DMA, FLOW_CTRL_DMA);
  return SFU_SUCCESS;
}
#endif /*SFU_DMA_PROTECT_ENABLE*/

#ifdef SFU_IWDG_PROTECT_ENABLE
/**
  *  @brief Apply IWDG protection
  *         The IWDG timeout is set to 4 second.
  *         Then, the IWDG reload counter is configured as below to obtain 4 second according
  *         to the measured LSI frequency after setting the prescaler value:
  *         IWDG counter clock Frequency = LSI Frequency / Prescaler value
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionIWDG(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /* TIMER could be used to get the LSI frequency in order to have a more precise IWDG.
  This is not used in this implementation because not necessary and in order
  to optimize code-size. If you are interested, please have a look at the IWDG Cube example. */

  /* Configure & Start the IWDG peripheral */
  /* Set counter reload value to obtain 6 sec. IWDG TimeOut.
  IWDG counter clock Frequency = uwLsiFreq
  Set Prescaler to 64 (IWDG_PRESCALER_64)
  Timeout Period = (Reload Counter Value * 64) / uwLsiFreq
  So Set Reload Counter Value = (6 * uwLsiFreq) / 64 */
  IwdgHandle.Instance = IWDG;
  IwdgHandle.Init.Prescaler = IWDG_PRESCALER_64;
  IwdgHandle.Init.Reload = (SFU_IWDG_TIMEOUT * LSI_VALUE / 64U);
  IwdgHandle.Init.Window = IWDG_WINDOW_DISABLE;

  {
    if (HAL_IWDG_Init(&IwdgHandle) == HAL_OK)
    {
      e_ret_status = SFU_SUCCESS;
      /* Execution stopped if flow control failed */
      FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_IWDG, FLOW_CTRL_IWDG);
    }
  }

  return e_ret_status;
}
#endif /*SFU_IWDG_PROTECT_ENABLE*/

#ifdef SFU_DAP_PROTECT_ENABLE
/**
  * @brief  Set DAP protection status, configuring SWCLK and SWDIO GPIO pins.
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionDAP(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  GPIO_InitTypeDef GPIO_InitStruct;

